Revit 2027 API
ConnectorElement.Domain Property
The domain of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Domain Domain { get; }
Public Overridable ReadOnly Property Domain As Domain
	Get
public:
virtual property Domain Domain {
	Domain get ();
}
abstract Domain : Domain with get
override Domain : Domain with get
Property Value
Domain
Implements
IConnector.Domain
Remarks
This property is used to retrieve the domain of the connector.
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace